## Plan Result (test_frontdoor)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 1 to change, 10 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;juror-bureau&#34;]
* Update
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Delete
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;juror-public&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test"
      + expiration_date          = (known after apply)
      + host_name                = "juror.test.apps.hmcts.net"
      + id                       = (known after apply)
      + name                     = "juror-bureau"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["juror-public"] will be destroyed
  # (because key ["juror-public"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      - cdn_frontdoor_profile_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test" -> null
      - expiration_date          = "2024-01-16T17:13:29.6381738+00:00" -> null
      - host_name                = "juror-public.test.apps.hmcts.net" -> null
      - id                       = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/customDomains/juror-public" -> null
      - name                     = "juror-public" -> null
      - validation_token         = "b599g3nyhcx3rsxj7y74387bm54jzm2v" -> null

      - tls {
          - cdn_frontdoor_secret_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/secrets/1696c369-e43f-4772-8852-bd55562867be-juror-public-test-apps-hmcts-net" -> null
          - certificate_type        = "ManagedCertificate" -> null
          - minimum_tls_version     = "TLS12" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["juror-public"] will be destroyed
  # (because key ["juror-public"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      - cdn_frontdoor_custom_domain_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/customDomains/juror-public" -> null
      - cdn_frontdoor_route_ids        = [
          - "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/afdEndpoints/sdshmcts-test/routes/juror-public",
        ] -> null
      - id                             = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/associations/juror-public" -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["juror-public"] will be destroyed
  # (because key ["juror-public"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      - cdn_frontdoor_custom_domain_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/customDomains/juror-public" -> null
      - cdn_frontdoor_route_ids        = [
          - "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/afdEndpoints/sdshmcts-test/routes/juror-publicHttpsRedirect",
        ] -> null
      - id                             = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/associations/juror-public" -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "jurorbureautestPremium"
      + resource_group_name   = "lz-test-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
          + "startupMode"  = "always"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["juror-public"] will be destroyed
  # (because key ["juror-public"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [] -> null
      - id                                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/jurorpublictestPremium" -> null
      - mode                              = "Prevention" -> null
      - name                              = "jurorpublictestPremium" -> null
      - resource_group_name               = "lz-test-rg" -> null
      - sku_name                          = "Premium_AzureFrontDoor" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-azure-platform"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "testing"
          - "startupMode"  = "always"
        } -> null

      - managed_rule {
          - action  = "Block" -> null
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = "firewall-nonprodi-palo-sdstest.uksouth.cloudapp.azure.com"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "juror-bureau"
      + origin_host_header             = "juror.test.apps.hmcts.net"
      + priority                       = 1
      + weight                         = 50
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["juror-public"] will be destroyed
  # (because key ["juror-public"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      - cdn_frontdoor_origin_group_id  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/originGroups/juror-public" -> null
      - certificate_name_check_enabled = true -> null
      - enabled                        = true -> null
      - health_probes_enabled          = true -> null
      - host_name                      = "firewall-nonprodi-palo-sdstest.uksouth.cloudapp.azure.com" -> null
      - http_port                      = 80 -> null
      - https_port                     = 443 -> null
      - id                             = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/originGroups/juror-public/origins/juror-public" -> null
      - name                           = "juror-public" -> null
      - origin_host_header             = "juror-public.test.apps.hmcts.net" -> null
      - priority                       = 1 -> null
      - weight                         = 50 -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      + cdn_frontdoor_profile_id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test"
      + id                                                        = (known after apply)
      + name                                                      = "juror-bureau"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = false

      + load_balancing {
          + additional_latency_in_milliseconds = 0
          + sample_size                        = 4
          + successful_samples_required        = 2
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group["juror-public"] will be destroyed
  # (because key ["juror-public"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      - cdn_frontdoor_profile_id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test" -> null
      - id                                                        = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/originGroups/juror-public" -> null
      - name                                                      = "juror-public" -> null
      - restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10 -> null
      - session_affinity_enabled                                  = false -> null

      - load_balancing {
          - additional_latency_in_milliseconds = 0 -> null
          - sample_size                        = 4 -> null
          - successful_samples_required        = 2 -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/afdEndpoints/sdshmcts-test"
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpOnly"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "juror-bureau"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Https",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["juror-public"] will be destroyed
  # (because key ["juror-public"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      - cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/customDomains/juror-public",
        ] -> null
      - cdn_frontdoor_endpoint_id       = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/afdEndpoints/sdshmcts-test" -> null
      - cdn_frontdoor_origin_group_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/originGroups/juror-public" -> null
      - cdn_frontdoor_origin_ids        = [
          - "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/originGroups/juror-public/origins/juror-public",
        ] -> null
      - cdn_frontdoor_rule_set_ids      = [] -> null
      - enabled                         = true -> null
      - forwarding_protocol             = "HttpOnly" -> null
      - https_redirect_enabled          = false -> null
      - id                              = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/afdEndpoints/sdshmcts-test/routes/juror-public" -> null
      - link_to_default_domain          = false -> null
      - name                            = "juror-public" -> null
      - patterns_to_match               = [
          - "/*",
        ] -> null
      - supported_protocols             = [
          - "Https",
        ] -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/afdEndpoints/sdshmcts-test"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/originGroups/defaultBackend"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/originGroups/defaultBackend/origins/defaultBackend",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/ruleSets/httpsredirect",
        ]
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "juror-bureauHttpsRedirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["juror-public"] will be destroyed
  # (because key ["juror-public"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      - cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/customDomains/juror-public",
        ] -> null
      - cdn_frontdoor_endpoint_id       = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/afdEndpoints/sdshmcts-test" -> null
      - cdn_frontdoor_origin_group_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/originGroups/defaultBackend" -> null
      - cdn_frontdoor_origin_ids        = [
          - "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/originGroups/defaultBackend/origins/defaultBackend",
        ] -> null
      - cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/ruleSets/httpsredirect",
        ] -> null
      - enabled                         = true -> null
      - forwarding_protocol             = "MatchRequest" -> null
      - https_redirect_enabled          = false -> null
      - id                              = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/afdEndpoints/sdshmcts-test/routes/juror-publicHttpsRedirect" -> null
      - link_to_default_domain          = false -> null
      - name                            = "juror-publicHttpsRedirect" -> null
      - patterns_to_match               = [
          - "/*",
        ] -> null
      - supported_protocols             = [
          - "Http",
        ] -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      + cdn_frontdoor_profile_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test"
      + id                       = (known after apply)
      + name                     = "jurorbureautestPremium-securityPolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["juror-public"] will be destroyed
  # (because key ["juror-public"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test" -> null
      - id                       = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/securityPolicies/jurorpublictestPremium-securityPolicy" -> null
      - name                     = "jurorpublictestPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/jurorpublictestPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test/customDomains/juror-public" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["juror-bureau"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.juror.test"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "apps.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["juror-public"] will be destroyed
  # (because key ["juror-public"] is not in for_each map)
  - resource "azurerm_dns_txt_record" "public_dns_record" {
      - fqdn                = "_dnsauth.juror-public.test.apps.hmcts.net." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apps.hmcts.net/TXT/_dnsauth.juror-public.test" -> null
      - name                = "_dnsauth.juror-public.test" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 3600 -> null
      - zone_name           = "apps.hmcts.net" -> null

      - record {
          - value = "b599g3nyhcx3rsxj7y74387bm54jzm2v" -> null
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Cdn/profiles/sdshmcts-test|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 10 to add, 1 to change, 10 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":658,"Program":"tfcmt","SHA1":"","Target":"test_frontdoor","Vars":{}} -->